Core/src/InformationRegisters/НДФЛСоциальныеВычеты/НДФЛСоциальныеВычеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НДФЛСоциальныеВычеты</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Применяется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодВычета</name>
    <type>
      <types>CatalogRef.ВычетыНДФЛ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/НДФЛСоциальныеВычеты/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Применяется Тогда
			Запись.Представление = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='თანხა ხარჯი: %1';ru='Сумма расхода:%1'"), Запись.СуммаРасходов)
				+ ?(ЗначениеЗаполнено(Запись.КодИФНС), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', საგადასახადო სამსახურის ინსპექციის კოდი:%1';ru=', код ИФНС:%1'"),Запись.КодИФНС),"")
				+ ?(ЗначениеЗаполнено(Запись.НомерУведомления), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', номер уведомления:%1';ru=', номер уведомления:%1'"),Запись.НомерУведомления),"")
				+ ?(ЗначениеЗаполнено(Запись.ДатаУведомления), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', შეტყობინების თარიღი:%1';ru=', дата уведомления:%1'"),Запись.ДатаУведомления),"");
			Иначе
				Запись.Представление =  НСтр("ka='Социальный вычет не применяется';ru='Социальный вычет не применяется'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
